Repository: LioChanDaYo/RGPDpseudonymizer
Catalog: gdpr_pseudonymizer/locale/*/LC_MESSAGES/cli.po
Languages: fr

source: GDPR-compliant pseudonymization tool for French text documents
fr: Outil de pseudonymisation conforme au RGPD pour documents en français

source: Show version and exit
fr: Afficher la version et quitter

source: Path to config file (default: ~/.gdpr-pseudo.yaml or ./.gdpr-pseudo.yaml)
fr: Chemin du fichier de configuration (par défaut : ~/.gdpr-pseudo.yaml ou ./.gdpr-pseudo.yaml)

source: Enable verbose logging (DEBUG level)
fr: Activer la journalisation détaillée (niveau DEBUG)

source: Suppress non-error output
fr: Supprimer les sorties non essentielles

source: Language for CLI help text (fr/en)
fr: Langue du texte d'aide CLI (fr/en)

source: Initialize a new encrypted mapping database
fr: Initialiser une nouvelle base de correspondances chiffrée

source: Database file path (default: mappings.db)
fr: Chemin du fichier de base de données (par défaut : mappings.db)

source: Database passphrase (or use GDPR_PSEUDO_PASSPHRASE env var)
fr: Phrase secrète de la base de données (ou variable d'environnement GDPR_PSEUDO_PASSPHRASE)

source: Overwrite existing database if it exists
fr: Écraser la base de données existante si elle existe

source: Process a single document with pseudonymization
fr: Traiter un document avec pseudonymisation

source: Input file path (.txt, .md, .pdf, or .docx)
fr: Chemin du fichier d'entrée (.txt, .md, .pdf ou .docx)

source: Output file path (defaults to <input>_pseudonymized.ext)
fr: Chemin du fichier de sortie (par défaut : <entrée>_pseudonymized.ext)

source: Pseudonym library theme (neutral/star_wars/lotr). Default from config.
fr: Thème de la bibliothèque de pseudonymes (neutral/star_wars/lotr). Par défaut depuis la configuration.

source: NLP model name (spacy). Default from config.
fr: Nom du modèle NLP (spacy). Par défaut depuis la configuration.

source: Database file path. Default from config.
fr: Chemin du fichier de base de données. Par défaut depuis la configuration.

source: Filter entity types to process (comma-separated). Options: PERSON, LOCATION, ORG. Default: all types.
fr: Filtrer les types d'entités à traiter (séparés par des virgules). Options : PERSON, LOCATION, ORG. Par défaut : tous les types.

source: Process multiple documents in a directory
fr: Traiter plusieurs documents dans un répertoire

source: Input directory or file path
fr: Chemin du répertoire ou fichier d'entrée

source: Output directory (defaults to same directory as input with _pseudonymized suffix)
fr: Répertoire de sortie (par défaut : même répertoire avec suffixe _pseudonymized)

source: Process subdirectories recursively
fr: Traiter les sous-répertoires récursivement

source: Continue processing on individual file errors (default: continue)
fr: Continuer le traitement en cas d'erreur sur un fichier (par défaut : continuer)

source: Number of parallel workers (1=sequential with validation, 2-8=parallel without validation). Default from config.
fr: Nombre de travailleurs parallèles (1=séquentiel avec validation, 2-8=parallèle sans validation). Par défaut depuis la configuration.

source: View entity-to-pseudonym mappings
fr: Afficher les correspondances entité-pseudonyme

source: Database file path
fr: Chemin du fichier de base de données

source: Filter by entity type (PERSON/LOCATION/ORG)
fr: Filtrer par type d'entité (PERSON/LOCATION/ORG)

source: Search by entity name (case-insensitive substring match)
fr: Rechercher par nom d'entité (correspondance insensible à la casse)

source: Export mappings to CSV file
fr: Exporter les correspondances vers un fichier CSV

source: Limit number of results
fr: Limiter le nombre de résultats

source: Review existing mappings without processing
fr: Examiner les correspondances existantes sans traitement

source: Interactive mode to review each mapping
fr: Mode interactif pour examiner chaque correspondance

source: Show database statistics and usage information
fr: Afficher les statistiques et informations d'utilisation de la base de données

source: Import mappings from another database
fr: Importer des correspondances depuis une autre base de données

source: Source database file to import from
fr: Fichier source de base de données à importer

source: Target database file path
fr: Chemin du fichier de base de données cible

source: Target database passphrase (or use GDPR_PSEUDO_PASSPHRASE env var)
fr: Phrase secrète de la base cible (ou variable d'environnement GDPR_PSEUDO_PASSPHRASE)

source: Source database passphrase (prompts if not provided)
fr: Phrase secrète de la base source (demandée si non fournie)

source: Skip duplicate entities (default) or prompt for each
fr: Ignorer les entités en double (par défaut) ou demander pour chacune

source: Export audit log to JSON or CSV
fr: Exporter le journal d'audit en JSON ou CSV

source: Output file path (.json or .csv)
fr: Chemin du fichier de sortie (.json ou .csv)

source: Filter by operation type (PROCESS/BATCH/VALIDATE/etc.)
fr: Filtrer par type d'opération (PROCESS/BATCH/VALIDATE/etc.)

source: Filter operations after this date (ISO 8601: YYYY-MM-DD)
fr: Filtrer les opérations après cette date (ISO 8601 : AAAA-MM-JJ)

source: Filter operations before this date (ISO 8601: YYYY-MM-DD)
fr: Filtrer les opérations avant cette date (ISO 8601 : AAAA-MM-JJ)

source: Show only successful operations
fr: Afficher uniquement les opérations réussies

source: Show only failed operations
fr: Afficher uniquement les opérations échouées

source: Delete entity mapping (GDPR Article 17 erasure)
fr: Supprimer une correspondance (effacement Article 17 du RGPD)

source: Entity name to delete
fr: Nom de l'entité à supprimer

source: Entity UUID to delete
fr: UUID de l'entité à supprimer

source: Reason for deletion (GDPR request reference)
fr: Motif de la suppression (référence de la demande RGPD)

source: Skip confirmation prompt
fr: Ignorer la demande de confirmation

source: List entities with search (for erasure workflow)
fr: Lister les entités avec recherche (pour le flux d'effacement)

source: Filter by type (PERSON/LOCATION/ORG)
fr: Filtrer par type (PERSON/LOCATION/ORG)

source: Securely delete the mapping database
fr: Supprimer de manière sécurisée la base de correspondances

source: Database file path to destroy
fr: Chemin du fichier de base de données à détruire

source: Skip confirmation prompt (use with caution)
fr: Ignorer la demande de confirmation (à utiliser avec précaution)

source: Passphrase to verify database ownership (recommended for safety)
fr: Phrase secrète pour vérifier la propriété de la base (recommandé)

source: Skip passphrase verification (not recommended)
fr: Ignorer la vérification de la phrase secrète (non recommandé)

source: View or modify configuration settings
fr: Afficher ou modifier les paramètres de configuration

source: Generate a template .gdpr-pseudo.yaml in current directory
fr: Générer un modèle .gdpr-pseudo.yaml dans le répertoire courant

source: Overwrite existing config file when using --init
fr: Écraser le fichier de configuration existant avec --init

source: Config key (e.g., pseudonymization.theme)
fr: Clé de configuration (ex : pseudonymization.theme)

source: Value to set
fr: Valeur à définir
